Ldalvik/C2000-WordClock/libraries/F28069M.c
#include <libraries/F28069M.h>

// Import Interrupt registers
extern volatile unsigned int IFR;
extern volatile unsigned int IER;

// Declare init functions
void PieCntlInit(void);
void PieVectTableInit(void);

// Import device flashing functions
void DeviceInit(Uint16 clock_source, Uint16 pllDiv);
void MemCopy(Uint16 *SourceAddr, Uint16 *SourceEndAddr, Uint16 *DestAddr);
void InitFlash();
extern Uint16 RamfuncsLoadStart, RamfuncsLoadEnd, RamfuncsRunStart;

/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 *  USEABLE GPIO PINS (Ordered by PIN)
 *
 * ~~~~~~~~ J1 ~~~~~~~~~
 *  PIN 1-4     N/A
 *  PIN 5       GPIO 12
 *  PIN 6       N/A
 *  PIN 7       GPIO 18
 *  PIN 8       GPIO 22
 *  PIN 9       GPIO 33
 *  PIN 10      GPIO 32
 * ~~~~~~~~~~~~~~~~~~~~~


 * ~~~~~~~~ J2 ~~~~~~~~~
 *  PIN 11      GPIO 55
 *  PIN 12      GPIO 51
 *  PIN 13      GPIO 50
 *  PIN 14      GPIO 17
 *  PIN 15      GPIO 16
 *  PIN 16-17   N/A
 *  PIN 18      GPIO 44
 *  PIN 19      GPIO 19
 *  PIN 20      N/A
 * ~~~~~~~~~~~~~~~~~~~~~


 * ~~~~~~~~ J3 ~~~~~~~~~
 *  PIN 21-30   N/A
 * ~~~~~~~~~~~~~~~~~~~~~


 * ~~~~~~~~ J4 ~~~~~~~~~
 *  PIN 31-33   N/A
 *  PIN 34      GPIO 13
 *  PIN 35      GPIO 5
 *  PIN 36      GPIO 4
 *  PIN 37      GPIO 3
 *  PIN 38      GPIO 2
 *  PIN 39      GPIO 1
 *  PIN 40      GPIO 0
 * ~~~~~~~~~~~~~~~~~~~~~


 * ~~~~~~~~ J5 ~~~~~~~~~
 *  PIN 41-44   N/A
 *  PIN 45      GPIO 20
 *  PIN 46      N/A
 *  PIN 47      GPIO 14
 *  PIN 48      GPIO 21
 *  PIN 49      GPIO 23
 *  PIN 50      GPIO 54
 * ~~~~~~~~~~~~~~~~~~~~~


 * ~~~~~~~~ J6 ~~~~~~~~~
 *  PIN 51      GPIO 56
 *  PIN 52      GPIO 53
 *  PIN 53      GPIO 52
 *  PIN 54      GPIO 25
 *  PIN 55      GPIO 24
 *  PIN 56-57   N/A
 *  PIN 58      GPIO 26
 *  PIN 59      GPIO 27
 *  PIN 60      N/A
 * ~~~~~~~~~~~~~~~~~~~~~


 * ~~~~~~~~ J7 ~~~~~~~~~
 *  PIN 61-70   N/A
 * ~~~~~~~~~~~~~~~~~~~~~


 * ~~~~~~~~ J8 ~~~~~~~~~
 *  PIN 71-74   N/A
 *  PIN 75      GPIO 11
 *  PIN 76      GPIO 10
 *  PIN 77      GPIO 9
 *  PIN 78      GPIO 8
 *  PIN 79      GPIO 7
 *  PIN 80      GPIO 6
 *  PIN 81      GPIO 34 (Red LED)
 *  PIN 82      GPIO 39 (Blue LED)
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 */

/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 *  USEABLE GPIO PINS (Ordered by GPIO)
 *
 *  GPIO 0       PIN 40
 *  GPIO 1       PIN 39
 *  GPIO 2       PIN 38
 *  GPIO 3       PIN 37
 *  GPIO 4       PIN 36
 *  GPIO 5       PIN 35
 *  GPIO 6       PIN 80
 *  GPIO 7       PIN 79
 *  GPIO 8       PIN 78
 *  GPIO 9       PIN 77
 *  GPIO 10      PIN 76
 *  GPIO 11      PIN 75
 *  GPIO 12      PIN 5
 *  GPIO 13      PIN 34
 *  GPIO 14      PIN 47
 *  GPIO 15      N/A
 *  GPIO 16      PIN 15
 *  GPIO 17      PIN 14
 *  GPIO 18      PIN 7
 *  GPIO 19      PIN 19
 *  GPIO 20      PIN 45
 *  GPIO 21      PIN 48
 *  GPIO 22      PIN 8
 *  GPIO 23      PIN 49
 *  GPIO 24      PIN 55
 *  GPIO 25      PIN 54
 *  GPIO 26      PIN 58
 *  GPIO 27      PIN 59
 *  GPIO 28-31   N/A
 *  GPIO 32      PIN 10
 *  GPIO 33      PIN 9
 *  GPIO 34      PIN 81
 *  GPIO 35-38   N/A
 *  GPIO 39      PIN 82
 *  GPIO 40-43   N/A
 *  GPIO 44      PIN 18
 *  GPIO 45-49   N/A
 *  GPIO 50      PIN 13
 *  GPIO 51      PIN 12
 *  GPIO 52      PIN 53
 *  GPIO 53      PIN 52
 *  GPIO 54      PIN 50
 *  GPIO 55      PIN 11
 *  GPIO 56      PIN 51
 *  GPIO 57-58   N/A
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 */

/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 * UN-USEABLE GPIO PINS
 * GPIO15  // UART
 * GPIO28  // UART
 * GPIO29  // UART
 * GPIO30  // CAN RX-A
 * GPIO31  // CAN TX-A
 * GPIO35  // TDI (JTAG Test Data Input)
 * GPIO36  // TMS (JTAG Test Mode Select)
 * GPIO37  // TDO (JTAG scan out, Test Data Output)
 * GPIO38  // TCK (JTAG Test Clock)
 * GPIO40  // PWM DAC1
 * GPIO41  // PWM DAC2
 * GPIO42  // PWM DAC3
 * GPIO43  // PWM DAC4
 * GPIO57  // SPISTE-A ???
 * GPIO58  // UART
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 */


// Device initialization
/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */

/* Initialize and flash the device,
 * then run the setup and infinite loop.
 *
 * void setup(void) -> setup method, runs once
 * void loop(void)  -> loop function, runs infinitely
 */
void DeviceSetup(void setup(void), void loop(void))
{
    DeviceInit(PLL_SRC, PLL_DIV);
#ifdef _FLASH
    MemCopy(&RamfuncsLoadStart, &RamfuncsLoadEnd, &RamfuncsRunStart);
    InitFlash();
#endif

    setup();
    for (;;)
    {
        loop();
    }
}

// Interrupts
 /* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */

/* Setup device for interrupts
 *
 * Initializes the needed functions and configurations
 * to use interrupts.
 *
 * no params
 */
void InitInterrupts(void)
{
    //DINT;        // Disable interrupts (This is done by PieCntlInit())
    IER = 0x0000;  // Clear interrupt enable register
    IFR = 0x0000;  // Clear interrupt flag register

    PieCntlInit();      // Initialize the PIE control registers to a known state
    PieVectTableInit(); // Initialize the PIE vector table

    EINT; // Clear flag to enable interrupts
    ERTM; // Enable real-time mode
    //PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;
}


/* Attach an interrupt to the board. Will automatically assign an interrupt based on the open CpuTimers.
 *
 * clearInterval(id) must be used in the interrupt to acknowledge it.
 * The ID will need to be the order in which the interrupts are activated,
 * so make sure to keep track of its count with a variable.
 *
 * void (*i)        -> the interrupt function
 * int TICKS_PER_MS -> Times the interrupt will be run each clock (1000 = runs every second)
 */
void attachInterrupt(void (*i), int TICKS_PER_MS)
{
    if (CpuTimer0Regs.TCR.bit.TIE == 0)
    {
        EALLOW;
        SysCtrlRegs.PCLKCR3.bit.CPUTIMER0ENCLK = 1;  // Enable CpuTimer0
        EDIS;

        CpuTimer0Regs.PRD.all = (uint32_t) (SYSCLK_HZ / (1000 * TICKS_PER_MS)); // Set clocking speed

        CpuTimer0Regs.TCR.bit.TIE = 1;     // Set CpuTimer0 interrupt enable flag
        PieCtrlRegs.PIEIER1.bit.INTx7 = 1; // Only CpuTimer0 uses this?

        PieCtrlRegs.PIEACK.bit.ACK1 = PIEACK_GROUP1; // Only CpuTimer0 uses the PIE and needs to be acknowledged

        EALLOW;
        PieVectTable.TINT0 = (PINT) i; // Set the address of the interrupt to the timer 0
        EDIS;
        IER |= M_INT1; // Set interrupt enable flag, CpuTimer0 only uses INT1-INT12

        printf("Timer0 Interrupt started\n");
    }
    else if (CpuTimer1Regs.TCR.bit.TIE == 0)
    {
        EALLOW;
        SysCtrlRegs.PCLKCR3.bit.CPUTIMER1ENCLK = 1;  // Enable CpuTimer1
        EDIS;
        CpuTimer1Regs.PRD.all = (uint32_t) (SYSCLK_HZ / (1000 * TICKS_PER_MS)); // Set clocking speed

        CpuTimer1Regs.TCR.bit.TIE = 1; // Set CpuTimer1 interrupt enable flag

        EALLOW;
        PieVectTable.TINT1 = (PINT) i; // Set the address of the interrupt to the timer 1
        EDIS;

        IER |= M_INT13; // Set the interrupt enable flag, CpuTimer1 uses INT13

        printf("Timer1 Interrupt started\n");
    }
    else if (CpuTimer2Regs.TCR.bit.TIE == 0)
    {
        EALLOW;
        SysCtrlRegs.PCLKCR3.bit.CPUTIMER2ENCLK = 1; // Enable CpuTimer2
        EDIS;
        CpuTimer2Regs.PRD.all = (uint32_t) (SYSCLK_HZ / (1000 * TICKS_PER_MS)); // Set clocking speed

        CpuTimer2Regs.TCR.bit.TIE = 1; // Set CpuTimer2 interrupt enable flag

        EALLOW;
        PieVectTable.TINT2 = (PINT) i; // Set address of interrupt to timer 2
        EDIS;
        IER |= M_INT14; // Set the interrupt enable flag, CpuTimer2 uses INT14

        printf("Timer2 Interrupt started\n");
    }
    else
    {
        printf("All CpuTimers are being used\n");
    }
}

/* Clear an interrupt. Used in an interrupt being passed to attachInterrupt, the ID must match the order in
 * which the interrupts are activated.
 *
 * int id -> ID of the CpuTimer the interrupt uses.
 */
void clearInterrupt(int id)
{
    switch (id)
    {
    case 0:
    {
        PieCtrlRegs.PIEACK.bit.ACK1 = PIEACK_GROUP1; // Only CpuTimer0 uses the PIE and needs to be acknowledged
        CpuTimer0Regs.TCR.bit.TIF = 1;               // Set the interrupt flag for CpuTimer0
        IER |= M_INT1;                               // Set the interrupt enable register
    }
        break;
    case 1:
    {
        CpuTimer1Regs.TCR.bit.TIF = 1; // Set the interrupt flag for CpuTimer1
        IER |= M_INT13;                // Set the interrupt enable register
    }
        break;
    case 2:
    {
        CpuTimer2Regs.TCR.bit.TIF = 1; // Set the interrupt flag for CpuTimer2
        IER |= M_INT14;                // Set the interrupt enable register
    }
        break;
    default:
        printf("Unknown ID: %d\n", id);
    }
}
/*
 * Stop an interrupt. The CpuTimer corresponding the the ID will be disabled.
 *
 * int id -> ID of the CpuTimer the interrupt uses.
 */

