Ldalvik/C2000-WordClock/libraries/F28069M.c
/*
 *
 */


/* Initialize the SPI-A bus.
 *
 * Initializes the SPI-A bus with specified settings
 *
 * int charLength  ->
 * int baudRate    ->
 * int clockParity ->
 * int clockPhase  ->
 * int spiMode     ->
 * int isTriWire   ->
 *
 */
void SpiA_Init(int charLength, int baudRate, int clockPolarity, int clockPhase, int spiMode, int isTriWire)
{
    /* SPI BUS-A SETUP
     * GPIO pins 16, 18, and 19 (pins 15, 7, 19)
     */
    EALLOW;
    SysCtrlRegs.PCLKCR0.bit.SPIAENCLK       = 1;                // Enable SPI-A peripheral clock
    GpioCtrlRegs.GPAMUX2.bit.GPIO16         = 1;                // Set GPIO16 (pin 15) to SPISIMO-A
    GpioCtrlRegs.GPAMUX2.bit.GPIO18         = 1;                // Set GPIO18 (pin 7)  to SPICLK-A
    //GpioCtrlRegs.GPAMUX2.bit.GPIO19         = 1;                // Set GPIO19 (pin 19) to SPISTE-A

    GpioCtrlRegs.GPAPUD.bit.GPIO16          = 0;                // Enable pull-up on SPISIMO-A
    GpioCtrlRegs.GPAPUD.bit.GPIO18          = 0;                // Enable pull-up on SPICLK-A
    GpioCtrlRegs.GPAPUD.bit.GPIO19          = 0;                // Enable pull-up on SPISTE-A

    GpioCtrlRegs.GPAQSEL2.bit.GPIO16        = 3;                // Enable asynchronous input on SPISIMO-A
    GpioCtrlRegs.GPAQSEL2.bit.GPIO18        = 3;                // Enable asynchronous input on SPICLK-A
    GpioCtrlRegs.GPAQSEL2.bit.GPIO19        = 3;                // Enable asynchronous input on SPISTE-A
    {
        SpiaRegs.SPICCR.bit.SPISWRESET      = 0;                // Put SPI config into reset mode
        SpiaRegs.SPICCR.bit.CLKPOLARITY     = 0;    // Set clock polarity to be falling or rising edge
        SpiaRegs.SPICCR.bit.SPICHAR         = (charLength - 1);   // Set char length - 1
        SpiaRegs.SPICTL.bit.MASTER_SLAVE    = spiMode;          // Set master or slave mode
        SpiaRegs.SPICTL.bit.CLK_PHASE       = clockPhase;       // Set clock phase to have a delay or no delay
        SpiaRegs.SPIPRI.bit.TRIWIRE         = isTriWire;        // Set SPI to be used in 3-Wire mode
//      SpiaRegs.SPIPRI.bit.FREE            = isFree;           // Don't stop at breakpoints
//      SpiaRegs.SPIPRI.bit.PRIORITY        = isPriority;       // Set SPI as priority
//      SpiaRegs.SPIPRI.bit.SOFT            = isSoft;           //
//      SpiaRegs.SPIPRI.bit.STEINV          = invertChipSelect; // Invert SPISTE (Signal becomes active high, only works with the MASTER_SLAVE bit set to 0)
        SpiaRegs.SPISTS.all                 = 0x00e0;           // Clear all status bits (1110000)
        SpiaRegs.SPIBRR                     = baudRate;         // Set SPI baud rate
        SpiaRegs.SPICCR.bit.SPISWRESET      = 1;                // Take SPI out of reset mode
    }
    EDIS;
}


void SpiA_Write(uint16_t data) {
    volatile uint16_t dummy;
    while (SpiaRegs.SPISTS.bit.BUFFULL_FLAG == 1){}    // Wait until buffer is cleared
    SpiaRegs.SPICTL.bit.TALK = 1;                      // Set transmit path to out
    SpiaRegs.SPITXBUF = (data << 8);                   // Send data
    while (SpiaRegs.SPISTS.bit.INT_FLAG != 1){}        // Wait for data to be received
    dummy = SpiaRegs.SPIRXBUF;                         // Clear the buffer
}

uint16_t SpiA_Read() {
    uint16_t rdata, dummy = 0;
    SpiaRegs.SPICTL.bit.TALK = 0;                // Disable transmit path. This makes it so data isn't received on the SPISOMIA pin
    SpiaRegs.SPITXBUF = dummy;                   // Send dummy data to initiate the TX
    while (SpiaRegs.SPISTS.bit.INT_FLAG != 1){}  // Wait until data is received
    rdata = SpiaRegs.SPIRXBUF;                   // Receive data
    return rdata;
}

// Other
/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */

/*
 *
 */

void Serial_print(char * str) {
    printf(str);
    fflush(stdout);
}

void Serial_println(char * str) {
    printf("%s\n", str);
    fflush(stdout);
}
